EDT/УТ/src/InformationRegisters/ЛогИнформированияПолучателейСамовывоза/ЛогИнформированияПолучателейСамовывоза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛогИнформированияПолучателейСамовывоза</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ИнформированиеПроизведено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоЗаказовВВыборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипИнформирования</name>
    <type>
      <types>EnumRef.ТипыИнформированияПолучателейЗаказов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/НастройкиУчетаОбщие/НастройкиУчетаОбщие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУчетаОбщие</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПовышающийКоэффициентТарификацииКилометража</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СистемаРаспознаванияАдресов</name>
    <type>
      <types>EnumRef.СистемыРаспознаванияАдресов</types>
    </type>
  </resources>
  <resources>
    <name>ТипИнформированияПолучателейЗаказов</name>
    <type>
      <types>EnumRef.ТипыИнформированияПолучателейЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>МетодикаТарификацииЗаборов</name>
    <type>
      <types>EnumRef.МетодыТарификацииЗаборов</types>
    </type>
  </resources>
  <resources>
    <name>СистемаРаспознаванияАдресовПриРучнойПривязке</name>
    <type>
      <types>EnumRef.СистемыРаспознаванияАдресов</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтказаПереносаПриОтменеЗаказаПартнеромВРейсе</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтказаПереносаПриСменеДатыДоставкиЗаказаПартнеромВРейсе</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтказаПереносаПриВыполненииЗаказаСРанееПеренесеннойДатой</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </resources>
  <resources>
    <name>МодельТерминалаAssist</name>
    <type>
      <types>CatalogRef.МоделиОборудования</types>
    </type>
  </resources>
  <resources>
    <name>ОбъединениеФункционалаЛогистаИКассира</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтказаПереносаОтменаПолучателем</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </resources>
  <resources>
    <name>НеПечататьБланкиЗаказовПоЗаказамДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПечатьБланковЗаказовКоличествоПозицийВЗаказе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтказаПереносаПриПереносеДатыДоставкиЗаказаПриЗагрузкеЗаказаИзАдминки</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаКонтрагентовДляЗагрузкиИзБП</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ТипыИнформированияПолучателейЗаказов/ТипыИнформированияПолучателейЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИнформированияПолучателейЗаказов</name>
  <enumValues>
    <name>СМС</name>
  </enumValues>
  <enumValues>
    <name>Viber</name>
  </enumValues>
  <enumValues>
    <name>СМСЧерезМПЭкипажей</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/ВидыЗапросовWEBСервис/ВидыЗапросовWEBСервис.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗапросовWEBСервис</name>
  <enumValues>
    <name>GetMapVersionsResult</name>
  </enumValues>
  <enumValues>
    <name>GetMapResult</name>
  </enumValues>
  <enumValues>
    <name>GetActiveMapVersionResult</name>
  </enumValues>
  <enumValues>
    <name>GetPolygonsForOrdersResult</name>
  </enumValues>
  <enumValues>
    <name>CreateMapResult</name>
  </enumValues>
  <enumValues>
    <name>SetActiveMapVersionResult</name>
  </enumValues>
  <enumValues>
    <name>GetDistanceResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrderCarsResult</name>
  </enumValues>
  <enumValues>
    <name>SetAcceptedPlacesResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrderLocationFlagResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrdersStatusResult</name>
  </enumValues>
  <enumValues>
    <name>UpdateReasonsDirectoryResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrdersFinalStatusResult</name>
  </enumValues>
  <enumValues>
    <name>GetOrdersTariffComponentsResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrdersTariffComponentsResult</name>
  </enumValues>
  <enumValues>
    <name>SetRefusedOrderItemsResult</name>
  </enumValues>
  <enumValues>
    <name>SetOrdersDeliveryDateResult</name>
  </enumValues>
  <enumValues>
    <name>SetServiceDcResult</name>
  </enumValues>
  <enumValues>
    <name>SetExcludedBarcodesResult</name>
  </enumValues>
  <enumValues>
    <name>DeleteFileResult</name>
  </enumValues>
  <enumValues>
    <name>SaveFileResult</name>
  </enumValues>
  <enumValues>
    <name>GetModifiedOrdersResult</name>
  </enumValues>
  <enumValues>
    <name>SetPendingChangesResult</name>
  </enumValues>
  <enumValues>
    <name>FinalizationPendingChangesResult</name>
  </enumValues>
  <enumValues>
    <name>GetDeliveryCostCalculationTariffsResult</name>
  </enumValues>
  <enumValues>
    <name>getCustomerLinkResult</name>
  </enumValues>
  <enumValues>
    <name>setOrdersStateResult</name>
  </enumValues>
  <enumValues>
    <name>uploadReceiptsResult</name>
  </enumValues>
  <enumValues>
    <name>setOrdersZoneResult</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/CommonModules/ИнформированиеКлиентовОДоставкеСервер/Module.bsl
Процедура ЗафиксироватьФактИнформированияСамовывоз(КоличествоЗаказов, ТипИнформирования, Терминал = Неопределено, ИнформированиеПроизведено = Истина, Пользователь = Неопределено) Экспорт
	Наб = РегистрыСведений.ЛогИнформированияПолучателейСамовывоза.СоздатьНаборЗаписей();
	
	Если Терминал = Неопределено Тогда
		Терминал = ПараметрыСеанса.ТерминалДоставки;
	КонецеСЛи;
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецеСЛи;
	
	
	ТекВр = ТекущаяДата();
	
	Наб.Отбор.Терминал.Установить(Терминал);
	Наб.Отбор.ТипИнформирования.Установить(ТипИнформирования);
	Наб.Отбор.Период.Установить(ТекВр);
	
	Нов = Наб.Добавить();
	Нов.ТипИнформирования = ТипИнформирования;
	Нов.Терминал = Терминал;
	Нов.ИнформированиеПроизведено = ИнформированиеПроизведено;
	Нов.КоличествоЗаказовВВыборке = КоличествоЗаказов;
	Нов.Период = ТекВр;
	Нов.Пользователь = Пользователь;
	
	Наб.Записать();
КонецПроцедуры	

Функция ПолучитьРежимИнформированияПолучателейЗаказов() Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	НастройкиУчетаОбщиеСрезПоследних.ТипИнформированияПолучателейЗаказов КАК ТипИнформированияПолучателейЗаказов
	            |ИЗ
	            |	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних КАК НастройкиУчетаОбщиеСрезПоследних";
	
	Выб = Зап.Выполнить().Выбрать();
	
	Если Выб.Следующий() Тогда
		Если Не ЗначениеЗаполнено(Выб.ТипИнформированияПолучателейЗаказов) Тогда
			Возврат Перечисления.ТипыИнформированияПолучателейЗаказов.СМС;
		Иначе
			Возврат Выб.ТипИнформированияПолучателейЗаказов;
		КонецеСли;	
	Иначе 
		Возврат Перечисления.ТипыИнформированияПолучателейЗаказов.СМС;
	КонецеСли;	
КонецФункции	

//Асеев 24.02.2022 (Задача № 4745)>>>
Функция ПолучитьСсылкиНаОтслеживаниеЗаказов(МассивНомеровЗаказов) Экспорт
	
	ТаблицаСсылокНаОтслеживание = Новый ТаблицаЗначений;
	КолонкиТаблицы = ТаблицаСсылокНаОтслеживание.Колонки;
	КолонкиТаблицы.Добавить("НомерЗаказа");
	КолонкиТаблицы.Добавить("СсылкаНаОтслеживание");
	
	ШаблонЗаказ = Новый ФиксированнаяСтруктура("OrderId");
	
	МассивЗаказов = Новый Массив;
	Для Каждого НомерЗаказа Из МассивНомеровЗаказов Цикл
		СтруктураЗаказ = Новый Структура(ШаблонЗаказ);
		СтруктураЗаказ.OrderId = НомерЗаказа;
		МассивЗаказов.Добавить(СтруктураЗаказ);
	КонецЦикла;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("orders", МассивЗаказов);
	
	ВидМетода = Перечисления.ВидыЗапросовWEBСервис.getCustomerLinkResult;
	
	ПолученныеДанные = ИнтеграцияСАдминкойWEBСервис.ВыполнитьЗапросКАдминке(ВидМетода, ПараметрыЗапроса);
	Если Не ПолученныеДанные.Успешно Тогда
		Возврат ТаблицаСсылокНаОтслеживание;
	КонецЕсли;
	
	getCustomerLinkResult = ПолученныеДанные.Данные.getCustomerLinkResult;
	Если Не getCustomerLinkResult.Succeded Тогда
		Возврат ТаблицаСсылокНаОтслеживание;
	КонецЕсли;
	
	МассивДанных = getCustomerLinkResult.Data;
	Если Не МассивДанных.Количество() Тогда
		Возврат ТаблицаСсылокНаОтслеживание;
	КонецЕсли;
	
	Для Каждого СтруктураДанных Из МассивДанных Цикл
		СтрокаТаблицы = ТаблицаСсылокНаОтслеживание.Добавить();
		СтрокаТаблицы.НомерЗаказа = СтруктураДанных.OrderId;
		СтрокаТаблицы.СсылкаНаОтслеживание = СтруктураДанных.CustomerLink;
	КонецЦикла;
	
	Возврат ТаблицаСсылокНаОтслеживание;
	
КонецФункции
//Асеев 24.02.2022 (Задача № 4745)<<<
